read_verilog 4x4_SG_SP_AR_RC.v
flatten
hierarchy -check -top Multiplier_3_0_3_000
write_verilog 4x4_SG_SP_AR_RC_fh.v
quit
